chapters.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-09 Thu 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hydrocat" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgca653f2">1. introduction</a></li>
<li><a href="#orgda7cc09">2. context</a></li>
<li><a href="#org943345c">3. objective</a></li>
<li><a href="#org014c10b">4. concepts and technologies</a>
<ul>
<li><a href="#orge6063d4">4.1. front-end</a>
<ul>
<li><a href="#orga405d8b">4.1.1. typescript</a></li>
<li><a href="#org5add943">4.1.2. html</a></li>
<li><a href="#org127a341">4.1.3. css</a></li>
<li><a href="#org3a3b284">4.1.4. scss</a></li>
<li><a href="#orge482056">4.1.5. angular</a></li>
<li><a href="#org02ce677">4.1.6. angular material</a></li>
<li><a href="#org9dc11e7">4.1.7. Sb-Angular-Material</a></li>
</ul>
</li>
<li><a href="#org127f0f8">4.2. back-end</a>
<ul>
<li><a href="#org90f5f50">4.2.1. java</a></li>
<li><a href="#orgd0dce5f">4.2.2. spring</a></li>
<li><a href="#orgb368636">4.2.3. rest</a></li>
<li><a href="#orga25095c">4.2.4. mariadb</a></li>
<li><a href="#orged5d723">4.2.5. ldap</a></li>
</ul>
</li>
<li><a href="#org5ae7432">4.3. development</a>
<ul>
<li><a href="#org1a11e27">4.3.1. apache netbeans</a></li>
<li><a href="#orgac7dacc">4.3.2. maven</a></li>
<li><a href="#org02fb710">4.3.3. lombok</a></li>
<li><a href="#org2e2e681">4.3.4. apache directory studio</a></li>
<li><a href="#org67665bd">4.3.5. visual studio code</a></li>
<li><a href="#org67a192b">4.3.6. docker</a></li>
<li><a href="#orgb90c7dd">4.3.7. docker-compose</a></li>
<li><a href="#orgfc5a3a4">4.3.8. mariadb</a></li>
<li><a href="#org0ef65ba">4.3.9. chinook database</a></li>
<li><a href="#orgaa6e032">4.3.10. angular cli</a></li>
<li><a href="#orgce0853c">4.3.11. firefox</a></li>
<li><a href="#org0c23b08">4.3.12. postman</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a52127">5. project</a>
<ul>
<li><a href="#org683d58d">5.1. use-cases</a></li>
<li><a href="#org4184135">5.2. class diagram</a></li>
<li><a href="#org5b01656">5.3. template angular-material</a></li>
<li><a href="#orgf42baeb">5.4. <span class="todo TODO">TODO</span> multi-database support</a></li>
</ul>
</li>
<li><a href="#org6b169f9">6. implementation and results</a>
<ul>
<li><a href="#orga541c46">6.1. front-end</a>
<ul>
<li><a href="#org317ec0c">6.1.1. component structure</a></li>
<li><a href="#orgaf94860">6.1.2. generic form controll builder</a></li>
<li><a href="#org110fcdd">6.1.3. spring HATEOAS classes</a></li>
<li><a href="#orgcea6ce4">6.1.4. temporal caching for repository index method</a></li>
<li><a href="#org1f8013f">6.1.5. error handler</a></li>
<li><a href="#orga516d8b">6.1.6. database reader</a></li>
</ul>
</li>
<li><a href="#orge792d07">6.2. back-end</a>
<ul>
<li><a href="#orgaa98037">6.2.1. java classes</a></li>
<li><a href="#org05db1c2">6.2.2. spring configuration</a></li>
<li><a href="#org3c6ea4c">6.2.3. custom controllers &amp; view models</a></li>
<li><a href="#org1aba0c7">6.2.4. spring repositories</a></li>
<li><a href="#org1579799">6.2.5. orm generated database</a></li>
<li><a href="#org33b90e6">6.2.6. multi-database support</a></li>
</ul>
</li>
<li><a href="#orgcafd2c9">6.3. development environment</a>
<ul>
<li><a href="#org1ca175e">6.3.1. Apache Directory</a></li>
<li><a href="#org3a216bc">6.3.2. multi-database support</a></li>
<li><a href="#orga8db4cf">6.3.3. postman tests</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgff46c51">7. conclusion</a></li>
<li><a href="#org5829e4e">8. future work</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgca653f2" class="outline-2">
<h2 id="orgca653f2"><span class="section-number-2">1</span> introduction</h2>
</div>
<div id="outline-container-orgda7cc09" class="outline-2">
<h2 id="orgda7cc09"><span class="section-number-2">2</span> context</h2>
</div>
<div id="outline-container-org943345c" class="outline-2">
<h2 id="org943345c"><span class="section-number-2">3</span> objective</h2>
</div>
<div id="outline-container-org014c10b" class="outline-2">
<h2 id="org014c10b"><span class="section-number-2">4</span> concepts and technologies</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge6063d4" class="outline-3">
<h3 id="orge6063d4"><span class="section-number-3">4.1</span> front-end</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orga405d8b" class="outline-4">
<h4 id="orga405d8b"><span class="section-number-4">4.1.1</span> typescript</h4>
</div>
<div id="outline-container-org5add943" class="outline-4">
<h4 id="org5add943"><span class="section-number-4">4.1.2</span> html</h4>
</div>
<div id="outline-container-org127a341" class="outline-4">
<h4 id="org127a341"><span class="section-number-4">4.1.3</span> css</h4>
</div>
<div id="outline-container-org3a3b284" class="outline-4">
<h4 id="org3a3b284"><span class="section-number-4">4.1.4</span> scss</h4>
</div>
<div id="outline-container-orge482056" class="outline-4">
<h4 id="orge482056"><span class="section-number-4">4.1.5</span> angular</h4>
</div>
<div id="outline-container-org02ce677" class="outline-4">
<h4 id="org02ce677"><span class="section-number-4">4.1.6</span> angular material</h4>
</div>
<div id="outline-container-org9dc11e7" class="outline-4">
<h4 id="org9dc11e7"><span class="section-number-4">4.1.7</span> Sb-Angular-Material</h4>
<div class="outline-text-4" id="text-4-1-7">
</div>
<ol class="org-ol">
<li><a id="orgd962213"></a>project structure<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org127f0f8" class="outline-3">
<h3 id="org127f0f8"><span class="section-number-3">4.2</span> back-end</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org90f5f50" class="outline-4">
<h4 id="org90f5f50"><span class="section-number-4">4.2.1</span> java</h4>
</div>
<div id="outline-container-orgd0dce5f" class="outline-4">
<h4 id="orgd0dce5f"><span class="section-number-4">4.2.2</span> spring</h4>
<div class="outline-text-4" id="text-4-2-2">
</div>
<ol class="org-ol">
<li><a id="org09b751e"></a>dependency injection<br /></li>
<li><a id="org4fbbec8"></a>boot<br /></li>
<li><a id="org4d95bfe"></a>data<br /></li>
<li><a id="org066a982"></a>web<br />
<ol class="org-ol">
<li><a id="orgd56fb82"></a>HATEOAS<br /></li>
</ol>
</li>
<li><a id="org9d191aa"></a>security<br /></li>
</ol>
</div>
<div id="outline-container-orgb368636" class="outline-4">
<h4 id="orgb368636"><span class="section-number-4">4.2.3</span> rest</h4>
</div>
<div id="outline-container-orga25095c" class="outline-4">
<h4 id="orga25095c"><span class="section-number-4">4.2.4</span> mariadb</h4>
</div>
<div id="outline-container-orged5d723" class="outline-4">
<h4 id="orged5d723"><span class="section-number-4">4.2.5</span> ldap</h4>
</div>
</div>
<div id="outline-container-org5ae7432" class="outline-3">
<h3 id="org5ae7432"><span class="section-number-3">4.3</span> development</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org1a11e27" class="outline-4">
<h4 id="org1a11e27"><span class="section-number-4">4.3.1</span> apache netbeans</h4>
</div>
<div id="outline-container-orgac7dacc" class="outline-4">
<h4 id="orgac7dacc"><span class="section-number-4">4.3.2</span> maven</h4>
</div>
<div id="outline-container-org02fb710" class="outline-4">
<h4 id="org02fb710"><span class="section-number-4">4.3.3</span> lombok</h4>
</div>
<div id="outline-container-org2e2e681" class="outline-4">
<h4 id="org2e2e681"><span class="section-number-4">4.3.4</span> apache directory studio</h4>
</div>
<div id="outline-container-org67665bd" class="outline-4">
<h4 id="org67665bd"><span class="section-number-4">4.3.5</span> visual studio code</h4>
</div>
<div id="outline-container-org67a192b" class="outline-4">
<h4 id="org67a192b"><span class="section-number-4">4.3.6</span> docker</h4>
</div>
<div id="outline-container-orgb90c7dd" class="outline-4">
<h4 id="orgb90c7dd"><span class="section-number-4">4.3.7</span> docker-compose</h4>
</div>
<div id="outline-container-orgfc5a3a4" class="outline-4">
<h4 id="orgfc5a3a4"><span class="section-number-4">4.3.8</span> mariadb</h4>
</div>
<div id="outline-container-org0ef65ba" class="outline-4">
<h4 id="org0ef65ba"><span class="section-number-4">4.3.9</span> chinook database</h4>
</div>
<div id="outline-container-orgaa6e032" class="outline-4">
<h4 id="orgaa6e032"><span class="section-number-4">4.3.10</span> angular cli</h4>
</div>
<div id="outline-container-orgce0853c" class="outline-4">
<h4 id="orgce0853c"><span class="section-number-4">4.3.11</span> firefox</h4>
<div class="outline-text-4" id="text-4-3-11">
</div>
<ol class="org-ol">
<li><a id="org559f8ea"></a>debugger<br /></li>
<li><a id="orgfac6e83"></a>webpack<br /></li>
</ol>
</div>
<div id="outline-container-org0c23b08" class="outline-4">
<h4 id="org0c23b08"><span class="section-number-4">4.3.12</span> postman</h4>
</div>
</div>
</div>
<div id="outline-container-org0a52127" class="outline-2">
<h2 id="org0a52127"><span class="section-number-2">5</span> project</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org683d58d" class="outline-3">
<h3 id="org683d58d"><span class="section-number-3">5.1</span> use-cases</h3>
</div>
<div id="outline-container-org4184135" class="outline-3">
<h3 id="org4184135"><span class="section-number-3">5.2</span> class diagram</h3>
</div>
<div id="outline-container-org5b01656" class="outline-3">
<h3 id="org5b01656"><span class="section-number-3">5.3</span> template angular-material</h3>
</div>
<div id="outline-container-orgf42baeb" class="outline-3">
<h3 id="orgf42baeb"><span class="section-number-3">5.4</span> <span class="todo TODO">TODO</span> multi-database support</h3>
</div>
</div>
<div id="outline-container-org6b169f9" class="outline-2">
<h2 id="org6b169f9"><span class="section-number-2">6</span> implementation and results</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga541c46" class="outline-3">
<h3 id="orga541c46"><span class="section-number-3">6.1</span> front-end</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org317ec0c" class="outline-4">
<h4 id="org317ec0c"><span class="section-number-4">6.1.1</span> component structure</h4>
<div class="outline-text-4" id="text-6-1-1">
</div>
<ol class="org-ol">
<li><a id="orgda489dd"></a>services<br /></li>
<li><a id="org73f8094"></a>modules<br /></li>
<li><a id="org0bc0e17"></a>dialog<br /></li>
</ol>
</div>
<div id="outline-container-orgaf94860" class="outline-4">
<h4 id="orgaf94860"><span class="section-number-4">6.1.2</span> generic form controll builder</h4>
</div>
<div id="outline-container-org110fcdd" class="outline-4">
<h4 id="org110fcdd"><span class="section-number-4">6.1.3</span> spring HATEOAS classes</h4>
<div class="outline-text-4" id="text-6-1-3">
</div>
<ol class="org-ol">
<li><a id="org9a284ed"></a>entity class<br /></li>
<li><a id="org598678f"></a>acessor class<br /></li>
<li><a id="org6bc762e"></a>repository class<br /></li>
<li><a id="org8b569b4"></a>repository service class<br /></li>
</ol>
</div>
<div id="outline-container-orgcea6ce4" class="outline-4">
<h4 id="orgcea6ce4"><span class="section-number-4">6.1.4</span> temporal caching for repository index method</h4>
</div>
<div id="outline-container-org1f8013f" class="outline-4">
<h4 id="org1f8013f"><span class="section-number-4">6.1.5</span> error handler</h4>
</div>
<div id="outline-container-orga516d8b" class="outline-4">
<h4 id="orga516d8b"><span class="section-number-4">6.1.6</span> database reader</h4>
</div>
</div>

<div id="outline-container-orge792d07" class="outline-3">
<h3 id="orge792d07"><span class="section-number-3">6.2</span> back-end</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orgaa98037" class="outline-4">
<h4 id="orgaa98037"><span class="section-number-4">6.2.1</span> java classes</h4>
<div class="outline-text-4" id="text-6-2-1">
</div>
<ol class="org-ol">
<li><a id="orgaee060f"></a>view models<br /></li>
</ol>
</div>
<div id="outline-container-org05db1c2" class="outline-4">
<h4 id="org05db1c2"><span class="section-number-4">6.2.2</span> spring configuration</h4>
<div class="outline-text-4" id="text-6-2-2">
</div>
<ol class="org-ol">
<li><a id="org2e317f7"></a>ldap<br /></li>
<li><a id="orgbe1e386"></a>security<br />
<ol class="org-ol">
<li><a id="orge607737"></a>admin resources<br /></li>
</ol>
</li>
<li><a id="orgc22b146"></a>cors mapping<br /></li>
<li><a id="org1cea199"></a>user details context mapper<br /></li>
</ol>
</div>
<div id="outline-container-org3c6ea4c" class="outline-4">
<h4 id="org3c6ea4c"><span class="section-number-4">6.2.3</span> custom controllers &amp; view models</h4>
<div class="outline-text-4" id="text-6-2-3">
</div>
<ol class="org-ol">
<li><a id="org2430b78"></a>database reader<br /></li>
<li><a id="org8916fab"></a>permission tree delete method<br /></li>
<li><a id="orge2330e8"></a>user<br /></li>
<li><a id="org3eb9cbe"></a>queries<br /></li>
<li><a id="org4364055"></a>permissions<br /></li>
</ol>
</div>
<div id="outline-container-org1aba0c7" class="outline-4">
<h4 id="org1aba0c7"><span class="section-number-4">6.2.4</span> spring repositories</h4>
</div>
<div id="outline-container-org1579799" class="outline-4">
<h4 id="org1579799"><span class="section-number-4">6.2.5</span> orm generated database</h4>
</div>
<div id="outline-container-org33b90e6" class="outline-4">
<h4 id="org33b90e6"><span class="section-number-4">6.2.6</span> multi-database support</h4>
</div>
</div>

<div id="outline-container-orgcafd2c9" class="outline-3">
<h3 id="orgcafd2c9"><span class="section-number-3">6.3</span> development environment</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org1ca175e" class="outline-4">
<h4 id="org1ca175e"><span class="section-number-4">6.3.1</span> Apache Directory</h4>
</div>
<div id="outline-container-org3a216bc" class="outline-4">
<h4 id="org3a216bc"><span class="section-number-4">6.3.2</span> multi-database support</h4>
<div class="outline-text-4" id="text-6-3-2">
</div>
<ol class="org-ol">
<li><a id="orge4468fe"></a>microsoft sql server docker image<br /></li>
<li><a id="org48297a3"></a>oracle:xe driver access<br /></li>
<li><a id="orged599d2"></a>testing file<br /></li>
</ol>
</div>
<div id="outline-container-orga8db4cf" class="outline-4">
<h4 id="orga8db4cf"><span class="section-number-4">6.3.3</span> postman tests</h4>
</div>
</div>
</div>
<div id="outline-container-orgff46c51" class="outline-2">
<h2 id="orgff46c51"><span class="section-number-2">7</span> conclusion</h2>
</div>
<div id="outline-container-org5829e4e" class="outline-2">
<h2 id="org5829e4e"><span class="section-number-2">8</span> future work</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hydrocat</p>
<p class="date">Created: 2019-05-09 Thu 13:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
